{
    
    "id2sign": 
    {"0": "<s>",
    "2": "</s>",
    "1": "<pad>",
    "3": "<unk>",
    "4": " ", "5": "!", "6": "\"", "7": "#", "8": "$", "9": "%", "10": "&", "11": "'", "12": "(", "13": ")", "14": "*", "15": "+", "16": ",", "17": "-", "18": ".", "19": "/", "20": "0", "21": "1", "22": "2", "23": "3", "24": "4", "25": "5", "26": "6", "27": "7", "28": "8", "29": "9", "30": ":", "31": ";", "32": "<", "33": "=", "34": ">", "35": "?", "36": "@", "37": "A", "38": "B", "39": "C", "40": "D", "41": "E", "42": "F", "43": "G", "44": "H", "45": "I", "46": "J", "47": "K", "48": "L", "49": "M", "50": "N", "51": "O", "52": "P", "53": "Q", "54": "R", "55": "S", "56": "T", "57": "U", "58": "V", "59": "W", "60": "X", "61": "Y", "62": "Z", "63": "[", "64": "\\", "65": "]", "66": "^", "67": "_", "68": "`", "69": "a", "70": "b", "71": "c", "72": "d", "73": "e", "74": "f", "75": "g", "76": "h", "77": "i", "78": "j", "79": "k", "80": "l", "81": "m", "82": "n", "83": "o", "84": "p", "85": "q", "86": "r", "87": "s", "88": "t", "89": "u", "90": "v", "91": "w", "92": "x", "93": "y", "94": "z", "95": "{", "96": "|", "97": "}", "98": "~", "99": "ˋ", "100": "ˊ", "101": "﹒", "102": "ˀ", "103": "˜", "104": "ˇ", "105": "ˆ", "106": "˒", "107": "‑"

    },
    
    
    "sign2id": {"<s>": 0,
    "</s>": 2,
    "<pad>": 1,
    "<unk>": 3,
    " ": 4, "!": 5, "\"": 6, "#": 7, "$": 8, "%": 9, "&": 10, "'": 11, "(": 12, ")": 13, "*": 14, "+": 15, ",": 16, "-": 17, ".": 18, "/": 19, "0": 20, "1": 21, "2": 22, "3": 23, "4": 24, "5": 25, "6": 26, "7": 27, "8": 28, "9": 29, ":": 30, ";": 31, "<": 32, "=": 33, ">": 34, "?": 35, "@": 36, "A": 37, "B": 38, "C": 39, "D": 40, "E": 41, "F": 42, "G": 43, "H": 44, "I": 45, "J": 46, "K": 47, "L": 48, "M": 49, "N": 50, "O": 51, "P": 52, "Q": 53, "R": 54, "S": 55, "T": 56, "U": 57, "V": 58, "W": 59, "X": 60, "Y": 61, "Z": 62, "[": 63, "\\": 64, "]": 65, "^": 66, "_": 67, "`": 68, "a": 69, "b": 70, "c": 71, "d": 72, "e": 73, "f": 74, "g": 75, "h": 76, "i": 77, "j": 78, "k": 79, "l": 80, "m": 81, "n": 82, "o": 83, "p": 84, "q": 85, "r": 86, "s": 87, "t": 88, "u": 89, "v": 90, "w": 91, "x": 92, "y": 93, "z": 94, "{": 95, "|": 96, "}": 97, "~": 98, "ˋ": 99, "ˊ": 100, "﹒": 101, "ˀ": 102, "˜": 103, "ˇ": 104, "ˆ": 105, "˒": 106, "‑": 107}}